[
    {
        "useful_art_i": 0,
        "useful_passage_i": 0,
        "article_title": "2023–24 PFF National Challenge Cup",
        "passage_start": 323,
        "passage_end": 460,
        "context": "The 2023–2024 PFF National Challenge Cup is the ongoing 30th edition of domestic cup competition in Pakistan. 27 departmental teams are participating in the competition, from 24 January 2023. The cup feature the 27 departmental teams across the country vying for the title, which will be defended by 2020 champions WAPDA.",
        "passage_text": "Initially scheduled to be held throughout 2023, the second knock-out phase will be held in May 2024 after almost 15 months of inactivity.",
        "question": "When is the second knock-out phase of the 2023–2024 PFF National Challenge Cup scheduled to take place after a period of inactivity?",
        "answer_quote": "the second knock-out phase will be held in May 2024 after almost 15 months of inactivity"
    },
    {
        "useful_art_i": 0,
        "useful_passage_i": 1,
        "article_title": "2023–24 PFF National Challenge Cup",
        "passage_start": 2242,
        "passage_end": 2453,
        "context": "In the first phase, teams, bracketed in seven groups, will compete on home and away basis. The leading two teams from each group and the two best third-placed sides will progress to the round of 16. The first phase was held at Karachi, Lahore, Bahawalpur, Faisalabad, Peshawar, Quetta, Chaman, Rawalpindi and Islamabad simultaneously. \nThe second phase, which will be knock-out, was set to be conducted from May 1 to 12 in 2023 at a centre yet to be decided. It was postponed to kick off on the 21st of October until 6 November 2023.",
        "passage_text": "After an uncertain inactivity almost 15 months after it began, the National Challenge Cup knockout stage was finally announced to reach its end in Lahore  from May 1 to 12 in 2024, starting with the round of 16.",
        "question": "When was the National Challenge Cup knockout stage announced to conclude in Lahore and which round was set to start the event?",
        "answer_quote": "the National Challenge Cup knockout stage was finally announced to reach its end in Lahore from May 1 to 12 in 2024, starting with the round of 16"
    },
    {
        "useful_art_i": 1,
        "useful_passage_i": 0,
        "article_title": "Beast of Two Worlds",
        "passage_start": 421,
        "passage_end": 512,
        "context": "Beast of Two Worlds (Ajakaju) is a 2024 Nigerian thriller film produced by Eniola Ajao and directed by Adebayo Tijani and Odunlade Adekola. The film stars Eniola Ajao, Odunlade Adekola, Sola Sobowale, Femi Adebayo, Lateef Adedimeji, Fathia Balogun, Bimbo Akintola, Olayode Juliana and others. The film which is Ajao's debut cinema production was produced in collaboration with Anthill studios owned by Niyi Akinmolayan.",
        "passage_text": "Beast of Two Worlds (Ajakaju) was released to the Nigerian cinema on Friday, 29 March 2024.",
        "question": "When was Beast of Two Worlds (Ajakaju) released to the Nigerian cinema?",
        "answer_quote": "Friday, 29 March 2024"
    },
    {
        "useful_art_i": 2,
        "useful_passage_i": 0,
        "article_title": "Any Other Way: The Jackie Shane Story",
        "passage_start": 344,
        "passage_end": 474,
        "context": "Any Other Way: The Jackie Shane Story is a Canadian documentary film, directed by Michael Mabbott and Lucah Rosenberg-Lee and released in 2024. The film is a portrait of Jackie Shane, the pioneering transgender singer who was a prominent figure in the Toronto music scene in the 1960s before virtually disappearing from public life after 1971.",
        "passage_text": "The film was based in large part on telephone interviews that Mabbott conducted with Shane over the year before her death in 2019.",
        "question": "What was the primary source material used for the film 'Any Other Way: The Jackie Shane Story'?",
        "answer_quote": "telephone interviews that Mabbott conducted with Shane over the year before her death in 2019"
    }
]